Revit 2026 API

# MacroManagerIteratorCurrent Property

---

Gets the item at the current position of the iterator.

**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual MacroModule Current { get; }
```
```vb
Public Overridable ReadOnly Property Current As MacroModule
	Get
```
```cpp
public:
virtual property MacroModule^ Current {
	MacroModule^ get ();
}
```
```fsharp
abstract Current : MacroModule with get
override Current : MacroModule with get
```

#### Property Value

MacroModule

#### Implements

IEnumeratorTCurrent

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

There is no current item if the iterator has not started yet or has been done.

#### Reference

MacroManagerIterator Class

Autodesk.Revit.DB.Macros Namespace